BRBPortal_CSharp/StaticData/UpdateUnitTenancy_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://cityofberkeley.info/RTS/ClientPortal/API">
  <soapenv:Header/>
  <soapenv:Body>
    <api:updateUnitTenancy>
      <unitTenancyUpdateReq>
        <userId>DAVE02</userId>
        <propertyId>1968</propertyId>
        <unitId>7773</unitId>
        <unitStatus>Rented</unitStatus>
        <initialRent>1234.56</initialRent>
        <tenancyStartDate>04/01/2018</tenancyStartDate>
        <priorTenancyEndDate>03/31/2018</priorTenancyEndDate>
        <!--Zero or more repetitions:-->
        <housingServices>
          <serviceName>Storage</serviceName>
        </housingServices>
        <housingServices>
          <serviceName>Garbage</serviceName>
        </housingServices>
        <housingServices>
          <serviceName>Laundry Access</serviceName>
        </housingServices>
        <!--Optional:-->
        <otherHousingService></otherHousingService>
        <noOfTenants>1</noOfTenants>
        <smokingProhibitionInLeaseStatus>Yes</smokingProhibitionInLeaseStatus>
        <smokingProhibitionEffectiveDate>04/01/2018</smokingProhibitionEffectiveDate>
        <reasonForTermination>1</reasonForTermination>
        <otherReasonForTermination></otherReasonForTermination>
        <!--Optional:-->
        <explainInvoluntaryTermination></explainInvoluntaryTermination>
        <!--Zero or more repetitions:-->
        <tenants>
          <code></code>
          <name>
            <first>DAVE</first>
            <!--Optional:-->
            <middle></middle>
            <last>BALMER</last>
            <suffix></suffix>
            <!--Optional:-->
            <nameLastFirstDisplay></nameLastFirstDisplay>
            <!--Optional:-->
            <agencyName></agencyName>
          </name>
          <phoneNumber>555-555-5555</phoneNumber>
          <emailAddress>david.b.balmer@transsight.com</emailAddress>
        </tenants>
        <declarationInitial>dbb</declarationInitial>
      </unitTenancyUpdateReq>
    </api:updateUnitTenancy>
  </soapenv:Body>
</soapenv:Envelope>